{
    "API": {
        "definition": "APIs allow different software applications to communicate with each other and share data in a standardized and structured way.",
        "more": "The Corda API enables developers using Corda to develop CorDapps by accessing data or functionality from a remote service or application, without needing to understand the underlying implementation details. For more information see the <a href=\"../developing-applications/api.html\"> Corda API documentation</a>. "
    },    
    "CorDapp": {
        "definition": "A distributed application (Dapp) deployed on Corda.",
        "more": "CorDapps encapsulate the logic that brings parties into agreement through flows.  For more information see the <a href=\"../key-concepts/fundamentals/cordapps.html\">Key Concepts</a> page. " 
    },
    "Virtual node": {
        "definition": "The combination of the context of an identity and the temporary compute instances created to execute flows on behalf of that identity." 
    },
    "Application network": {
        "definition": "The set of all possible entities onboarded according to the rules of the network. Application networks enable people and businesses to interact with each other on Corda.",
        "more": "New entities can join a network by installing a single file distributed by the network manager. Network participants are Corda identities represented by Virtual Nodes. They communicate or transact using the CorDapps contained in the network's installer. Participants can join multiple application networks using different Virtual Nodes, which can all run on a single node infrastructure. For more information see the <a href=\"../key-concepts/fundamentals/application-networks.html\">Key Concepts</a> page. "
    },
    "Notary": {
        "definition": "Corda’s uniqueness consensus service. The notary’s primary role is to prevent double-spends by ensuring each transaction contains only unique unconsumed input states. ",
        "more": "It also acts as the time-stamping authority. Every transaction includes a time window and it can only be notarized during that window. For more information, see <a href=\"../developing-applications/ledger/notaries.html\">Notaires</a>."
    } ,
    "Group policy": {
        "definition": "A JSON file containing network information that is bundled with a CPB to create a CPI. ",
        "more": "You can create this file using the Corda CLI or, for members joining a group, export it from the MGM."
    },
    "CPK": {
        "definition": "Corda Package. A signed ZIP/JAR library of Java code packaged to be portable with all of its dependencies and version information contained within it.",
        "more": "CPKs are designed to be modular so that reusable libraries of code, or data models, can be shared between projects."
    }, 
    "CPB": {
        "definition": "Corda Package Bundle. A signed ZIP/JAR collection of CPKs that forms a complete application suite and contains all the code that a virtual node must operate, minus the specific network details. ",
        "more": "This separation is present in Corda 5 so that software can be developed and tested against development networks and then fuller UAT networks before final publication of the production CPI with the surety that the code has not changed."
    },
    "CPI": {
        "definition": "Corda Package Installer. A signed ZIP/JAR combination of a CPB and a Group Policy File that defines not only the application code that a virtual node will run, but also the details of the MGM with which to register, and the details of network PKI requirements.",
        "more": "A CPI must be installed into a Corda Cluster before creating and registering a virtual node, as it defines the application software that will be run and the requirements for membership on that network.​"
    },   
    "Autoscaling": {
        "definition": "A technique used to automatically adjust the amount of computing resources allocated to an application or service based on its workload.",
        "more": "If a sudden increase in demand is experienced for an application or service, autoscaling increases provided resources to cope with demand. This intervention can be manual or automatic and is designed to reduce chances of service interruption, or performance issues."
    }, 
    "Bootstrapping": {
        "definition": "To boot or to load a program using a much smaller initial program to load in the desired program.",
        "more": "This is usually an operating system or setup files that can be implemented automatically or manually."
    }, 
    "CA": {
        "definition": "Certificate Authority. The holders of a PKI trust root that can issue certificates to customers." ,
        "more": "When you set up a membership group, you must decide which certificate authorities apply to various identities: TLS, ledger, and REST user identities."
    }, 
    "Cluster": {
        "definition": "A complete set of worker processes. Clusters require a fully-functioning virtual node infrastructure",
        "more": "The cluster hosts a dynamically-configured set of virtual nodes, which are equivalent to nodes used in Corda 4."
    }, 
    "Corda Host": {
        "definition": "A complete set of worker processes. Clusters require a fully-functioning virtual node infrastructure",
        "more": "The cluster hosts a dynamically-configured set of virtual nodes, which are equivalent to nodes used in Corda 4."
    }, 
    "Consensus": {
        "definition": "Consensus that a proposed transaction is valid is required before you can add it to the ledger. ",
        "more": "In Corda, this is achieved by proving a transaction is both <i>valid</i> and <i>unique</i>:<ul><li>Validity consensus determines if a transaction is accepted by the smart contracts it references.</li><li>Uniqueness consensus prevents double-spends.</li></ul>"
    }, 
    "Corda CLI": {
        "definition": "A command line tool that supports various Corda-related tasks, including Corda Package Installer (CPI) creation and Corda cluster management. ",
        "more": "The CorDapp Standard Development Environment (CSDE) uses Corda CLI in the background. As a result, you must install Corda CLI before using CSDE."
    }, 
    "CorDapp": {
        "definition": "Corda Distributed Application. A Java (or any JVM targeting language) application built using the Corda build toolchain and Corda APIs to solve some problem that is best solved in a decentralized manner. CorDapps are assembled as one or more JAR files bundled into the CorDapp packaging format. That file is then uploaded to Corda where it is executed, Corda acting as the application host for the CorDapp.",
        "more": "A CorDapp is distributed because parts of the application can be, or may need to be, executed on a Corda instance that is operated by another party that is a member of the same Corda Application Network."
    }, 
    "Crypto worker": {
        "definition": "A worker that manages the cryptographic materials of the Corda cluster and virtual nodes. It connects to any Hardware Security Modules (HSM) used to hold private keys, as well as database(s) used as a software HSM to hold wrapped and encrypted private keys.",
        "more": "When a virtual node needs to sign data, the request is sent across Kafka to one of the Crypto workers which performs the signing. The Crypto workers also provide admin functions to generate certificate signing requests and import certificates from external PKI providers and Certificate Authorities."
    }, 
    "CSDE": {
        "definition": "CorDapp Standard Development Environment. The recommended developer environment setup for developers wishing to write Corda 5 CorDapps.",
        "more": "For more information see <a href=\"../developing-applications/getting-started.html\">Getting Started Using the CSDE</a>."
    }, 
    "Database worker": {
        "definition": "A worker that connects to, manages, and operates upon the database(s) used by the Corda Cluster. This includes the cluster-level database schemas needed to store configuration data for the cluster, but also the separate databases/schemas used by each virtual node. ",
        "more": "When a virtual node reads or writes ledger data, the work request is sent across Kafka to one of the Database workers for processing and the results are returned to the Flow Engine over Kafka."
    }, 
    "DLT": {
        "definition": "Distributed Ledger Technology. A type of database technology that enables a network of computers to maintain a shared and synchronized database. It is a decentralized and transparent ledger that records transactions in a tamper-evident and secure manner, making it well-suited for use cases that require high levels of security, trust, and transparency.",
        "more": ""
    }, 
    "ECDH": {
        "definition": "Elliptic-curve Diffie–Hellman. A key sharing algorithm, most commonly used to send encrypted messages. ",
        "more": "ECDH works by multiplying your private key by another's public key to get a shared secret, then using that shared secret to perform symmetric encryption."
    }, 
    "Entity": {
        "definition": "An organisation or individual that participates in one ore more application networks that can provide attestation that they are whom they claim to be.",
        "more": "An entity will have many identities. "
    }, 
    "Flow": {
        "definition": "Communication between participants in an application network is peer-to-peer using flows. ",
        "more": "Flows automate the process of agreeing ledger updates between two or more participants. "
    }, 
    "Flow worker": {
        "definition": "A worker that runs the CorDapp application code and translates flow API calls into function requests to the relevant workers. The flow workers are designed to share work between themselves and to record checkpoints at each stage of the application's progress, so that in the event of worker failure, the operations can be retried.",
        "more": "Similarly, when a CorDapp sends messages to a peer, the flow worker is responsible for the higher level retry, deduplication, and re-ordering of messages above and beyond the simple packet retries of the Link Manager messaging layer. In the case of unrecoverable errors, or loss of synchronization between virtual nodes, the flow worker signals the errors via the REST worker APIs and abort any remote operations that have been started in peers. In combination with the platform ledger code, this ensures that ledger operations operate atomically across peers."
    }, 
    "Gateway worker": {
        "definition": "A worker designed to communicate with external Corda Clusters via HTTPS. They have restricted access only to specific topics on the Kafka bus and view only the minimum information needed for their role. The gateway workers are the only component of the cluster with access to the wider network and transfer Link Manager session messages taken from Kafka, then using HTTPS POST to send to the peer's gateway worker. ​",
        "more": "After local validation is received, messages are placed onto Kafka for the Link Manager to process. The gateway workers play the important role of establishing and validating the TLS links established to peer Corda Clusters and accessing external resources such as certificate revocation servers, or border proxies. Gateway workers have no direct access to any keys and can only request that the crypto workers sign the TLS handshake data via a specific Kafka topic. Crucially, the gateway worker has no ability to access the keys used in the Ledger, or by the Link Manager."
    }, 
    "Helm": {
        "definition": "A package manager for Kubernetes, which is an open-source container orchestration platform. ",
        "more": "Helm simplifies the deployment and management of complex applications on Kubernetes by providing a way to package, deploy, and manage Kubernetes resources."
    }, 
    "Holding identity": {
        "definition": "A group’s addressable identity on a network, plus its X.500 name.",
        "more": ""
    }, 
    "Identity": {
        "definition": "The representation of an entity within a single application network. This will be represented by an X.500 name that must be determined as unique within the application network.",
        "more": "Membership is granted based on evidence from the entity submitted at time of request, that they are whom they claim to be. The threshold for that claim is the responsibility of the Application Network Operator to set out in their Terms of Service. The Network Operator can choose any approach here, from accepting entities at their word, through to a full KYC process."
    }, 
    "JKS": {
        "definition": "Java KeyStore",
        "more": "A repository of security certificates, either authorization certificates or public key certificates, plus corresponding private keys, used for instance in TLS encryption."
    }, 
    "Kafka": {
        "definition": "The means by which Corda workers communicate, acting as a central message bus between the worker processes. ",
        "more": "Apache Kafka is an open-source distributed streaming platform that is used for building real-time data pipelines and streaming applications. Kafka is designed to handle high-volume, high-throughput, and low-latency data streams, making it a popular choice for processing data in real-time applications. "
    }, 
    "Kubernetes": {
        "definition": "A powerful tool for managing containerized applications at scale, making it easier for teams to deploy and manage their applications with high reliability and efficiency.",
        "more": ""
    }, 
    "Distributed ledger": {
        "definition": "A database of facts that is replicated, shared, and synchronized across multiple participants on a network.",
        "more": ""
    }, 
    "Ledger identity": {
        "definition": "Signs transactions and states. By default, the session identity is the same as the ledger identity; however, you can set them to be different.",
        "more": ""
    }, 
    "Ledger key": {
        "definition": "A key which can be used to sign for transactions. This key may be held confidentially and signatures may be used as evidence of authority to sign transactions. Alternatively, it may be published in the virtual nodes's <code>MemberInfo</code> to act as a published fact to prove the identity of the virtual node on the ledger.",
        "more": ""
    }, 
    "Link Manager": {
        "definition": "Part of the peer-to-peer system responsible for end-to-end authentication and encrypting virtual node messages.",
        "more": ""
    }, 
    "Member": {
        "definition": "Corda identity that has been granted admission to a membership group. Synonym for a virtual node. Same as a group member.",
        "more": ""
    }, 
    "MemberInfo": {
        "definition": "Information about peer group members as distributed securely by the MGM. Contains information about session and ledger identity, connectivity details, and software version details. ",
        "more": "A membership group and a CPI publisher may also define custom attributes in the <code>MemberInfo</code>. The MGM and the group member sign over the <code>MemberInfo</code> to confirm the validity of the information from Kafka, which may be for a different identity and/or flow."
    }, 
    "Membership group": {
        "definition": "A logical grouping of multiple Corda identities, which communicate and transact with each other using a specific set of CorDapps.",
        "more": ""
    }, 
    "Membership worker": {
        "definition": "A worker that manages the peer-to-peer routing information available to virtual nodes. The membership workers communicate periodically with the MGM to ensure they have up-to-date network information on peers. This MGM communication is secured via the Link Manager protocols.",
        "more": "If the Corda Cluster is hosting a Membership Group Manager(MGM), then the Membership worker is also responsible for hosting the administrative and broadcast functions of the MGM."
    }, 
    "MGM": {
        "definition": "Membership Group Manager. May also be referred to as the Network Manager. It is a virtual node and Corda identity that acts as a central registrar for group membership. ",
        "more": "The CPI files point at the MGM server, so that when a virtual node is created, the node contains the PKI policies and addresses the MGM. The MGM server is responsible for accepting membership proposals. For users coming from Corda 4, MGM replaces CENM."
    }, 
    "PKI": {
        "definition": "A comprehensive system of hardware, software, policies, and procedures that enables the secure creation, distribution, management, and revocation of digital certificates and public-key cryptography.",
        "more": ""
    }, 
    "P2P Link Manager worker": {
        "definition": "A Worker that manages the secure transmission of packets to peers. The main functional component is the Link Manager which establishes end-to-end secure sessions for virtual nodes to communicate over.",
        "more": "The Link Manager uses the data provided to it by the membership worker to translate virtual node names on Cordapp packets to physical HTTPS destination addresses and requests the gateway worker to transmit its secured packets to the peers. If packets cannot be delivered the Link Manager also manages redelivery, possibly via alternate gateway workers.​"
    }, 
    "RBAC": {
        "definition": "Role-based access control. Also known as role-based security. A permission system to restrict system access based on assigned permissions.",
        "more": ""
    }, 
    "REST user identity": {
        "definition": "A login to the REST endpoint, typically by single sign-on (SSO). Each login is associated with customizable permissions on the cluster and virtual nodes.",
        "more": ""
    }, 
    "REST worker": {
        "definition": "A Worker that exposes the intranet HTTPS REST control ports of the Corda cluster. The REST workers support all the dynamic administration APIs of the cluster, such as APIs to configure the cluster, or setup user role based permissions, or create and register virtual nodes. They also provide the virtual node endpoint APIs for invoking the flows and the ledger applications and retrieving their status/results. ​",
        "more": "All REST calls must be authenticated and authorized, typically using OAUTH2 for login/authentication and Role Based Access Controls checked against a user permissions database."
    }, 
    "Revocation checks": {
        "definition": "In the context of X.509 certificates, revocation checks refer to the process of verifying whether a digital certificate is still valid and has not been revoked by the issuing Certificate Authority (CA). Revocation checks are typically performed using mechanisms such as Certificate Revocation Lists (CRLs) or the Online Certificate Status Protocol (OCSP), which provide up-to-date information on the revocation status of certificates.",
        "more": ""
    }, 
    "Sandbox": {
        "definition": "An execution environment within a JVM process that provides isolation for a CorDapp. It shields it from outside threats but it also restricts what it can do so that running potentially dangerous code cannot harm others.",
        "more": "While CorDapp writers trust their own code, they can not trust CorDapps written by others, so Corda, as an application hosting platform, treat CorDapps as untrusted code that could be malicious."
    }, 
    "Session identity": {
        "definition": "Validates the end-to-end connectivity between virtual nodes.",
        "more": ""
    }, 
    "Session initiation key": {
        "definition": "The key for a virtual node, which is published in the `MemberInfo`, and used by Link Managers to authenticate and establish secure messaging sessions between network members.",
        "more": ""
    }  
}    